In [1]:
import pandas as pd
from pandas import DataFrame, Series
import numpy as np

In [3]:
df = DataFrame([[1.4, np.nan],
               [7.1, -4.5],
               [np.nan, np.nan],
               [0.75, -1.3]],
              index = list('abcd'),
              columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [5]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [6]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [7]:
df.idxmax()

one    b
two    d
dtype: object

In [8]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [10]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [13]:
obj = Series(list('aabc')*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [14]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [3]:
from pandas_datareader import data

### pandas_data reader에서 주가 자료 추출  

1. data.DataReader에 자료가 있고, data.DataReader("소스", 'google', "시작날자", "종료날자")로 원하는 자료 추출

2. 소스 별로 데이터 정리

3. all_data.items()로 tic, data로 구분

- tic은 "소스", data 는 "실제 values"로 구분

4. all_data에서 price는 종가, volume은 거래량 dataframe으로 변환

In [31]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker, 'google', '2015-01-01', '2016-01-01')

price = pd.DataFrame({tic: data['Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

 <br>

In [34]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2017-10-03  0.004356  0.004742  0.000818 -0.004691
2017-10-04 -0.006473 -0.006379 -0.002044  0.005790
2017-10-05  0.012445  0.019208  0.001638  0.017138
2017-10-06 -0.000579  0.009207 -0.001636  0.000395
2017-10-09  0.003477 -0.001931  0.006212  0.003816

In [37]:
returns['MSFT'].corr(returns.IBM)

0.13303402764915043

In [39]:
returns.MSFT.cov(returns["IBM"])

1.0651981037753465e-05

In [40]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.506419  0.056841  0.456833
GOOG  0.506419  1.000000  0.121943  0.637453
IBM   0.056841  0.121943  1.000000  0.133034
MSFT  0.456833  0.637453  0.133034  1.000000

In [41]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000118  0.000055  0.000005  0.000045
GOOG  0.000055  0.000101  0.000011  0.000059
IBM   0.000005  0.000011  0.000077  0.000011
MSFT  0.000045  0.000059  0.000011  0.000083

In [45]:
returns.corrwith(returns.IBM)

AAPL    0.056841
GOOG    0.121943
IBM     1.000000
MSFT    0.133034
dtype: float64

In [47]:
obj = Series(list('cadaabbcc'))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [49]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [50]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [53]:
obj.count()

9

In [58]:
pd.value_counts(obj.values)

a    3
c    3
b    2
d    1
dtype: int64

### 특정 값 찾기

In [59]:
obj.isin(['b','c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [60]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

 <br>
 ___

In [67]:
q1 = [1,3,4,3,4]
q2 = [2,3,1,2,3]
q3 = [1,5,2,4,4]
data = DataFrame({'q1':q1, 'q2':q2, 'q3':q3})
data

   q1  q2  q3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4

In [73]:
result = data.apply(pd.value_counts).fillna(0)
result

    q1   q2   q3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

 <br>
 ___

In [74]:
from numpy import nan as NA

In [75]:
data = Series([1,2,NA,3,5,NA])
data

0    1.0
1    2.0
2    NaN
3    3.0
4    5.0
5    NaN
dtype: float64

In [76]:
data.dropna()

0    1.0
1    2.0
3    3.0
4    5.0
dtype: float64

In [79]:
data[data.notnull()]

0    1.0
1    2.0
3    3.0
4    5.0
dtype: float64

In [80]:
data = DataFrame([[1,6.5,3], [1,NA,NA], [NA]*3, [NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [81]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [83]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [86]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [87]:
data.dropna(how = 'all', axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

 <br>
 ___

In [99]:
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.788905 -1.016903  2.664722
1 -2.179156 -1.362781 -0.162062
2  0.663323  1.035039  0.712239
3  1.293862 -1.124112  1.294905
4 -0.316291  1.403046 -1.745538
5 -0.171090  0.821620 -0.181534
6  0.075261  2.200999  0.060782

In [100]:
df.loc[:4,1] = NA; df.loc[:2,2] = NA
df

          0         1         2
0 -0.788905       NaN       NaN
1 -2.179156       NaN       NaN
2  0.663323       NaN       NaN
3  1.293862       NaN  1.294905
4 -0.316291       NaN -1.745538
5 -0.171090  0.821620 -0.181534
6  0.075261  2.200999  0.060782

In [94]:
df.dropna(thresh = 2)

          0         1         2
3 -0.322221       NaN -0.775995
4  0.558479       NaN  0.029668
5 -0.460086  0.712389  1.236936
6 -0.942332  0.605365  0.310324

In [101]:
df.fillna(0)
#df[df.isnull()]=0

          0         1         2
0 -0.788905  0.000000  0.000000
1 -2.179156  0.000000  0.000000
2  0.663323  0.000000  0.000000
3  1.293862  0.000000  1.294905
4 -0.316291  0.000000 -1.745538
5 -0.171090  0.821620 -0.181534
6  0.075261  2.200999  0.060782

In [103]:
df.fillna({1:'x', 2:'y'})

          0        1          2
0 -0.788905        x          y
1 -2.179156        x          y
2  0.663323        x          y
3  1.293862        x    1.29491
4 -0.316291        x   -1.74554
5 -0.171090  0.82162  -0.181534
6  0.075261    2.201  0.0607819

In [106]:
df.fillna(method='bfill')

          0         1         2
0 -0.212269  0.166595 -0.754095
1 -1.202951  0.166595 -0.754095
2 -0.505444  0.166595 -0.754095
3 -0.874990  0.166595 -0.754095
4  1.823049  0.166595  0.138869
5 -0.188021  0.166595  0.992320
6 -0.096785 -0.856963 -0.378594

In [111]:
df.fillna(df.mean())

          0         1         2
0 -0.212269 -0.345184 -0.000375
1 -1.202951 -0.345184 -0.000375
2 -0.505444 -0.345184 -0.000375
3 -0.874990 -0.345184 -0.754095
4  1.823049 -0.345184  0.138869
5 -0.188021  0.166595  0.992320
6 -0.096785 -0.856963 -0.378594